[
  {
    "id": "1",
    "categories": ["official","software"],
    "image": "./assets/images/project/1.png",
    "title": "Flora EFTN",
    "excerpt":"Implement a continuous and automated upgrade of Electronic Fund Transfer (EFT) services, featuring extensive integration with diverse Core Banking Systems",
    "tags": ["Flora Systems Ltd","ASP.NET","oAuth","JWT","MSSQL Server","Electronic Fund Transfer (EFT)","Banking System","Banking System Integration","BEFTN Outward Automation"],
    "objective": "This project aims to implement a continuous and automated upgrade of Electronic Fund Transfer (EFT) services, featuring extensive integration with diverse Core Banking Systems and multiple transaction channels. The goal is to modernize the fund transfer infrastructure and expand service accessibility.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Automated EFT Upgrade with comprehensive Core Banking System integration.",
      "Support for diverse payment channels (Cheque, iBanking, MFS, Credit Cards).",
      "Robust Security Stack: Ping Federate, JWT, oAuth token-based authentication.",
      "Technologies include ASP.NET, MS SQL, RESTful API, WCF, and SFTP."
    ],
    "link": "https://github.com/Aronno1920"
  }
  ,
  {
    "id": "2",
    "categories": ["official","software"],
    "image": "./assets/images/project/2.png",
    "title": "Niloy Hero",
    "excerpt":"Web-based Enterprise Resource Planning (ERP) System for vehicle operations, built on the ASP.NET framework and Microsoft SQL Server.",
    "tags": ["Nitol Niloy Group","Vehicle Operations ERP","ASP.NET","SQL Server","Procurement to Pay (P2P)","Workshop","Inventory Management"],
    "objective":"This is a comprehensive, web-based Enterprise Resource Planning (ERP) System for vehicle operations, built on the ASP.NET framework and Microsoft SQL Server. It centralizes and streamlines all core processes, from procurement and inventory management to complex workshop operations and financial accounting.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "End-to-End P2P Cycle: From requisition approval to material receipt and vendor payment.",
      "Advanced Inventory Management: Real-time tracking, Bin Management, and automated low-stock alerts.",
      "Integrated Workshop Module: Manages Job Card Creation and automated material consumption tracking.",
      "Financial Automation: Automatic Bill Generation and seamless General Ledger posting."
    ],
    "link": "https://github.com/Aronno1920"
  },
  {
    "id": "3",
    "categories": ["official","software"],
    "image": "./assets/images/project/3.png",
    "title": "Orion POS for Resturant",
    "excerpt":"POS software solution primarily designed for the 'Fish & Co.' and 'Krispy Kreme'.",
    "tags": ["ORION","Personal","ASP.NET Core",".NET 9","Elasticsearch","Full-Text Search","Data Seeding","Performance Tracking","Entity Framework Core","SQL Server"],
    "objective": "OrionPOS is a Point of Sale (POS) software solution primarily designed for the hospitality industry, such as restaurants, cafes, bars, and similar businesses.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Core Operations: Manages all essential restaurant tasks, including order taking, table management, bill printing, inventory tracking, and KDS integration.",
      "Customization: Highly flexible and modular design allows users to customize operational rules, automation commands, and screen layouts.",
      "Versions & Support: Has evolved through several versions (V3-V5); newer versions are commercial and offer professional support.",
      "Database: Typically relies on Microsoft SQL Server for reliable data storage."
    ],
    "link": "https://github.com/Aronno1920"
  },
  {
    "id": "4",
    "categories": ["software", "personal"],
    "image": "./assets/images/project/4.png",
    "title": " ElasticSearch Solutions in .NET CORE",
    "excerpt":"Integrating Elasticsearch into a .NET Core 9 WebAPI project involves several key steps, including installing the required packages, configuring the client, indexing data, and querying Elasticsearch. ",
    "tags": ["Personal","ASP.NET Core",".NET 9","Elasticsearch","Full-Text Search","Data Seeding","Performance Tracking","Entity Framework Core","SQL Server"],
    "objective": "This project develops a .NET 9 Web API for comprehensive product management, showcasing advanced data integration and search capabilities. It implements standard CRUD operations for products, utilizing Entity Framework Core with SQL Server as the primary data store.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      ".NET 9 Web API with comprehensive CRUD endpoints.",
      "Dual Search Functionality using SQL Server and Elasticsearch.",
      "Automatic Data Seeding (200,000+ products via Bogus).",
      "Performance Tracking middleware and Swagger documentation."
    ],
    "link": "https://github.com/Aronno1920/ElasticPracticeSolution"
  },
  {
    "id": "5",
    "categories": ["software", "personal"],
    "image": "./assets/images/project/5.png",
    "title": "eCommerce Application using Microservice Architecture",
    "excerpt":"The application includes microservices for Product, Basket, Discount and Ordering modules, which are essential for building e-commerce applications.",
    "tags": ["Personal",".NET",".NET Core","Clean Architecture","MongoDB","Redis","PostgreSQL","Ocelot","RabbitMQ","gRPC","Microservices Architecture"],
    "objective": "This project outlines a microservice application built on the Clean Architecture principle, emphasizing separation of concerns and maintainability. It integrates diverse data storage technologies: MongoDB (NoSQL) and Redis (caching) for unstructured data, and PostgreSQL and Sql Server (relational) for structured data.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Multi-Database Architecture (NoSQL, Relational, Caching).",
      "RabbitMQ for Asynchronous Communication and Ocelot API Gateway.",
      "gRPC (Google Remote Procedure Call) for high-performance service calls.",
      "Clean Architecture principle implemented with C#/.NET."
    ],
    "link": "https://github.com/Aronno1920/Microservices_Ecommerce"
  },
  {
    "id": "6",
    "categories": ["software", "official"],
    "image": "./assets/images/project/6.png",
    "title": "Employee Assessment System",
    "excerpt":"Performance management by directly linking employee evaluation to the core responsibilities and expected outcomes defined in each specific job description",
    "tags": ["ORION","ASP.Net","MSSQL Server","Role-based KPIs","Job Description Metrics","Functional Performance Assessment","Evaluation","Job-based Performance Indicators (PIs)"],
    "objective": "This system provides absolute clarity in performance management by directly linking employee evaluation to the core responsibilities and expected outcomes defined in each specific job description. It ensures every employee is measured against clear, relevant, and fair role-based benchmarks.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Unique PIs defined and assigned for every specific job title.",
      "Performance metrics linked directly to core duties in job descriptions.",
      "Automated performance scoring based on job function weightings.",
      "Reporting features to compare performance across similar roles."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "7",
    "categories": ["software", "official"],
    "image": "./assets/images/project/7.png",
    "title": "AI-Powered Online Exam System",
    "excerpt":"Performance management by directly linking employee evaluation to the core responsibilities and expected outcomes defined in each specific job description",
    "tags": ["ORION","MAUI","ASP.Net","MSSQL Server","Digital Examination Platform","AI-Powered Assessment","Question Bank Management","Online Examination System","MCQ Auto-Grading", "AI Narrative Grading", "Role-Based Marking", "Automated Assessment", "NLP for Exams"],
    "objective": "This is an advanced, secure, web-based platform designed to revolutionize the examination process for educational and corporate bodies. It provides a complete solution, from online registration and question bank management to diverse answering formats including MCQ and narrative responses.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Online Registration handles secure candidate sign-ups, fee payments, and document uploads.",
      "Question Bank Management offers a centralized, rich, and searchable repository for all question types.",
      "Exam Scheduling & Creation allows easy configuration of exam parameters, duration, and rules like negative marking.",
      "Secure Exam Delivery prevents cheating through randomization, time limits, and optional proctoring integration.",
      "MCQ Auto-Marking instantly and automatically grades multiple-choice questions upon submission.",
      "Role-Based & AI Narrative Marking enables human evaluators and AI to score and provide feedback on subjective, long-form answers."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "8",
    "categories": ["application", "official"],
    "image": "./assets/images/project/8.png",
    "title": "Orion Portal",
    "excerpt":"Key functions include Smart Attendance Tracking, simplified Leave Application & Approval, and Out-Station Adjustment submission.",
    "tags": ["ORION","Android","Java",".Net Core API","HR & Employee Self-Service (ESS)","Smart Attendance Tracking","Mobile Leave Management","Payslip/Performance App"],
    "objective": "This is an all-in-one HR & Employee Self-Service Android App designed to manage work seamlessly and keep employees connected. It empowers the workforce with faster communication, easy accessibility, and secure services directly on their mobile devices.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Smart Attendance Tracking (Anytime, Anywhere marking).",
      "Comprehensive Leave Management (Application, Tracking, Approval).",
      "Instant access to Payslips, Salary Breakdown, and Performance Updates.",
      "Secure Employee Self-Service (ESS) portal with company notifications."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "9",
    "categories": ["software", "official"],
    "image": "./assets/images/project/9.png",
    "title": "E-Document Tracking System",
    "excerpt":"Key functions include Smart Attendance Tracking, simplified Leave Application & Approval, and Out-Station Adjustment submission.",
    "tags": ["ORION","Android","Java",".Net Core API","HR & Employee Self-Service (ESS)","Smart Attendance Tracking","Mobile Leave Management","Payslip/Performance App"],
    "objective": "This is a secure, intelligent, and scalable Document Management System (DMS) designed to manage the complete lifecycle of digital documents, from creation to archival. It provides a centralized repository ensuring efficiency, compliance, and simplified cross-departmental collaboration.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Centralized Repository with Store and organize files in secure, advanced search and metadata indexing.",
      "Role-Based Approval System with digital signatures and audit logs.",
      "Seamless Collaboration with Share documents, add comments, and work together in real time.",
      "Workflow Automation for routing, reminders, and escalation tracking.",
      "Version Control & Audit Trail with Track revisions, maintain history, and ensure compliance."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "10",
    "categories": ["software", "official"],
    "image": "./assets/images/project/10.png",
    "title": "Vehicle Management System",
    "excerpt":"Comprehensive digital platform designed to simplify and automate from requisition to maintenance, it ensures efficient fleet management, cost control, and compliance.",
    "tags": ["ORION","ASP.Net","MSSQL Server","VMS","Vehicle Management System","Fleet Management Software","Fuel Tracking","Maintenance Tracking","Compliance Automation"],
    "objective":"This is a comprehensive Vehicle Management System (VMS) designed to simplify and automate all aspects of organizational vehicle operations. It provides a digital platform to ensure efficient fleet management, strict cost control, and full compliance with government regulations.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Streamlined Requisition and transparent vehicle assignment workflow.",
      "Fuel Management (Requisition, Consumption Log, and Bill Adjustment).",
      "Automated Compliance Alerts for registration, tax token, and insurance.",
      "Structured Maintenance Records for tracking costs and scheduling preventive care.",
      "Data-driven insights for efficient fleet management and cost savings, Streamlined vehicle requisition and assignment process."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "11",
    "categories": ["application", "official"],
    "image": "./assets/images/project/11.png",
    "title": "Prescription Mind to Heart",
    "excerpt":"Prescription Mind to Heart (PMH) is powerful mobile solution designed to empower medical representatives, sales teams, informed, and connected while on the move.",
    "tags": ["ORION","Android","Java",".Net Core API","Field Force Mobile Application","Medical Sales","Pharma Tech","Digital Brochure Sharing","Knowledge Hub","Real-Time Notifications"],
    "objective": "This is a Field Force Android Application, a powerful mobile solution designed to empower medical representatives and sales teams. It streamlines daily activities, supports knowledge sharing, and enhances communication to ensure field staff stay productive, informed, and connected while on the move.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Medical Promotion & Campaign material access and sharing.",
      "Digital Brochure Sharing ('Brushier Share') with tracking features.",
      "Real-Time Notifications for urgent updates and policy changes.",
      "Knowledge Hub for continuous learning via medical articles and research."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "12",
    "categories": ["application", "official"],
    "image": "./assets/images/project/12.png",
    "title": "Orion Scholars",
    "excerpt":"Orion’s CSR (Corporate Social Responsibility) initiative. It streamlines the scholarship management process, ensuring transparency, efficiency, and accessibility for both administrators and students.",
    "tags": ["ORION","Android","Java",".Net Core API","CSR Scholarship Management","Mobile","Admin Panel","Financial Disbursement","Tracking","Student Database","Cheque Reconciliation"],
    "objective":"Orion Scholars is a secure Android application with an integrated Admin Panel dedicated to managing Orion's CSR scholarship initiative. The platform ensures efficiency, accessibility, and absolute transparency for administrators and student recipients throughout the scholarship process.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "CSR Scholarship Management via integrated Admin Panel and Android App.",
      "Month-Wise Scholarship Setup and Bank Cheque Disbursement tracking.",
      "Budget Management with detailed cost tracking for accountability.",
      "Digital Confirmation and Real-Time Notifications for students."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "13",
    "categories": ["software", "official"],
    "image": "./assets/images/project/13.png",
    "title": "SAP | MM Module | OHAL | POWER",
    "excerpt":"SAP Material Management (MM) module, focusing on the entire Procurement to Pay (P2P) cycle within the broader SAP landscape.",
    "tags": ["ORION","SAP","MM Module","OHAL","POWER","Data Preparation","User Training","Implementation","SAP Material Management (MM)","Procurement to Pay","Master Data Preparation","Inventory Control","Stock Accounting"],
    "objective": "This comprehensive program provides an in-depth exploration of the SAP Material Management (MM) module, focusing on the entire Procurement to Pay (P2P) cycle within the broader SAP landscape. It covers core MM Business Concepts and the essential preparation of Master Data (Material, Vendor, Service).",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "End-to-End P2P Cycle managed within the SAP MM module.",
      "Focus on Master Data Preparation (Material, Vendor, Service) and Business Concepts.",
      "Covers all core transactions: Requisition, Purchasing, Goods Receipt, and Bill Settlement.",
      "Includes advanced topics like Inventory Control, Stock Accounting, and Material Loan Process."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "14",
    "categories": ["software", "official"],
    "image": "./assets/images/project/14.png",
    "title": "Supply Chain Management System (SCM)",
    "excerpt":"Comprehensive digital platform that integrates all core business stages: procurement, inventory, logistics",
    "tags": ["ORION","ASP.Net","MSSQL Server","Supply Chain Management (SCMS)","Procurement","MRP","Inventory Management","Warehouse Management","Logistics & Distribution","Three-Way Match"],
    "objective": "This Supply Chain Management System (SCMS) is a comprehensive digital platform that integrates all core business stages: procurement, inventory, logistics, production, and distribution. It provides organizations with greater efficiency, real-time visibility, and control over the end-to-end supply chain.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "End-to-End Supply Chain Integration (Procurement, Inventory, Logistics).",
      "Automated Stock Replenishment and Batch/Lot Tracking.",
      "Logistics Optimization with route planning and delivery scheduling.",
      "Financial Control via Three-Way Match and automated MRP."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  },
  {
    "id": "15",
    "categories": ["software", "official"],
    "image": "./assets/images/project/15.png",
    "title": "Website Development",
    "excerpt":"Involved developing a custom WordPress-based website to establish a single, unified digital presence",
    "tags": ["ORION","Wordpress","CodeIgniter","Php","mySQL","Custom WordPress Development","Multi-Business Unit Website","Responsive Web Design","Scalable Content Management"],
    "objective": "This project involved developing a custom WordPress-based website to establish a single, unified digital presence for multiple Orion business units. The solution was engineered to be modern, responsive, and user-friendly, providing scalable Content Management for diverse ventures spanning fitness, hospitality, and healthcare.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Unified Digital Platform managing multiple diverse business units.",
      "Custom WordPress Theme ensuring consistent branding and responsive design.",
      "Dedicated modules for Gym (Booking), Restaurant (Reservations), and Corporate Display.",
      "Optimized for SEO, performance, and security enhancements."
    ],
    "link": "https://www.linkedin.com/in/aronno1920/"
  }



















  ,
  {
    "id": "50",
    "categories": ["application", "personal"],
    "image": "./assets/images/project/50.png",
    "title": "TechAid24",
    "excerpt":"TechAid24 is an independent online technical support platform and publication dedicated to empowering learners, developers, and tech enthusiasts.",
    "tags": ["Personal","TechAid24","Blog Site", "Technical Blog","AI related Bangla Blog"],
    "objective": "TechAid24 is an independent online technical support platform and publication dedicated to empowering learners, developers, and tech enthusiasts. We specialize in simplifying technology and providing real-world solutions through practical tutorials and expert guidance across a wide spectrum of topics.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Independent Online Platform for technical support and publication.",
      "Specializes in Android, Web Dev, SQL, and Troubleshooting tutorials.",
      "Expert Team committed to prompt responses and personalized guidance.",
      "Mission: Simplify technology and provide real-world solutions openly."
    ],
    "link": "https://techaid24.com"
  },
  {
    "id": "51",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/51.png",
    "title": "Diabetes Detection System",
    "excerpt":"Build and evaluate a machine learning model that detect diabetes using a given medical features dataset for binary classification.",
    "tags": ["Personal","Binary Classification","Diabetes Prediction","Logistic Regression","KNN","Decision Tree","Random Forest","Stochastic Gradient Descent","Gradient Boosting","AdaBoost","Extra Trees","Support Vector Machine","Naive Bayes","ROC AUC","Feature Scaling","Machine Learning"],
    "objective": "This project involves developing a Diabetes Detection System using a given medical features dataset for binary classification. The objective is to build a robust predictive model that can accurately classify the Outcome (presence or absence of diabetes) from features like Glucose, BMI, and Age.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Binary Classification for Diabetes Detection from medical features.",
      "Comparative evaluation of Logistic Regression, KNN, and Decision Trees.",
      "Essential preprocessing includes feature scaling (where applicable).",
      "Performance metrics: Confusion Matrix, F1-score, and ROC AUC."
    ],
    "link": "https://colab.research.google.com/drive/1grLlQDlWzbQRq1Mnhkl9YH1rZk6LhiLF#scrollTo=rVqAjWQg19ip"
  },
  {
    "id": "52",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/52.png",
    "title": "Clustering Assignment using Iris Dataset",
    "excerpt":"Build and evaluate a deep learning model that classifies handwritten digits (0–9) using the MNIST dataset. This project will reinforce core deep learning concepts such as data preprocessing.",
    "tags": ["Personal","Clustering Algorithms","K-Means","DBSCAN","Hierarchical","Iris Dataset","StandardScaler","Unsupervised Learning"],
    "objective": "This assignment focuses on applying and comparing three distinct clustering algorithms—K-Means, Hierarchical Clustering, and DBSCAN—to the famous Iris dataset. The objective is to group the flowers based solely on their four continuous features (sepal and petal dimensions), excluding the target species column.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Comparative Clustering of K-Means, Hierarchical, and DBSCAN.",
      "Applied to the Iris Dataset after StandardScaler preprocessing.",
      "Uses Elbow Method and Dendrogram for optimal parameter selection.",
      "Includes EDA and Visualization of resulting clusters."
    ],
    "link": "https://colab.research.google.com/drive/1mAW9mE-_2IIrZXnF16ybmFjss-2oJW_X?usp=sharing"
  },
  {
    "id": "53",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/53.png",
    "title": "Digit Classifier (MNIST)",
    "excerpt":"Build and evaluate a deep learning model that classifies handwritten digits (0–9) using the MNIST dataset. This project will reinforce core deep learning concepts such as data preprocessing.",
    "tags": ["Personal","MNIST Classifier","Batch Normalization","Dropout Regularization","Keras","Deep Learning","Deep Learning Architecture"],
    "objective": "This project focuses on building and evaluating a Deep Neural Network to classify handwritten digits using the iconic MNIST dataset. The primary objective is to reinforce essential deep learning techniques like data preparation and regularization.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Deep Neural Network for Handwritten Digit Classification (MNIST).",
      "Mandatory use of Batch Normalization and Dropout layers.",
      "Data Preprocessing (Normalization and Flattening).",
      "Visual reporting of Training vs. Validation Accuracy history."
    ],
    "link": "https://github.com/Aronno1920/Digit-Classifier-MNIST"
  },
  {
    "id": "54",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/54.png",
    "title": "Image Classification with NN vs CNN",
    "excerpt":"Full-stack web application that allows users to upload an image of a fashion item (e.g., shirt, sneaker, bag) and classifies it using a NN and CNN",
    "tags": ["Personal","Image Classification","NN","CNN","NN vs. CNN","Fashion MNIST","TensorFlow","Flask","FastAPI","Deep Learning","Deep Learning Architecture"],
    "objective": "This project conducts a comparative performance analysis between a standard Neural Network (NN) and a Convolutional Neural Network (CNN) on the Fashion MNIST image classification dataset. The objective is to highlight the architectural advantage of CNNs in visual tasks.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Comparative Analysis of NN vs. CNN performance.",
      "Classification on the Fashion MNIST dataset (10 categories).",
      "Data preprocessing includes normalization and reshaping for both models.",
      "Output includes test accuracy and visualized sample predictions for each model."
    ],
    "link": "https://github.com/Aronno1920/Fashion-Classifier-MNIST"
  },
  {
    "id": "55",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/55.png",
    "title": "Object Tracking & Heatmap Visualization",
    "excerpt":"Using Object Tracking & Heatmap Visualization, Build a system that counts how many people enter or exit a defined area based on movement across two lines.",
    "tags": ["Personal","People Flow Detection","Object Tracking (ByteTrack/SORT)","ByteTrack","SORT","YOLO Detection","Heatmap Visualization","Counting"],
    "objective": "This project builds a People Flow Detection system by integrating object tracking with motion counting and heatmap visualization. The system uses a pre-trained YOLO model for person detection and a high-performance tracker (e.g., ByteTrack) to maintain unique identities across frames of the provided video.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Object Detection and Tracking (YOLO and ByteTrack/DeepSORT).",
      "Directional Flow Counting (IN/OUT logic across two lines).",
      "Heatmap Visualization of people presence/motion intensity.",
      "Output includes live counters and bounding boxes with unique IDs."
    ],
    "link": "https://colab.research.google.com/drive/1LrghvQSfU4WAIVVYd-zd7vl_-4t-06CF?usp=sharing"
  },
  {
    "id": "56",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/56.png",
    "title": "Model & APIs Deployment on Render",
    "excerpt":"Serves predictions from a machine learning classifier trained on the Heart Disease Dataset, Dockerize it, and deploy to Render.",
    "tags": ["Personal","FastAPI Deployment","Docker","Machine Learning API","Render Cloud Host","Model","Deployement"],
    "objective": "This project involves deploying a machine learning model trained on the Heart Disease Dataset via a FastAPI web service. The focus is on the complete deployment pipeline, from training a simple classifier (e.g., Logistic Regression) to serving predictions via API endpoints.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "FastAPI serving predictions from a Heart Disease Classifier.",
      "Pydantic schema validation for all input features.",
      "Dockerization for consistent, reproducible environments.",
      "Cloud Deployment (e.g., Render) of the containerized application."
    ],
    "link": "https://github.com/Aronno1920/Predict-Heart-Disease"
  },
  {
    "id": "57",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/57.png",
    "title": "Sentiment Analysis using IMDB Dataset",
    "excerpt":"Sentiment analysis using the IMDB movie reviews dataset, which can classify whether a given review expresses a positive or negative opinion.",
    "tags": ["Personal","Sentiment Analysis","Text Vectorization","IMDB","TF–IDF","Word2Vec","BERT","NLP Classification"],
    "objective": "This project focuses on sentiment analysis using the IMDB movie reviews dataset, which is balanced between positive and negative opinions. The core objective is to build binary classification models and critically compare how different text representation methods impact performance.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Sentiment Analysis on the IMDB Reviews Dataset.",
      "Comparative study of TF–IDF, Word2Vec, and BERT embeddings.",
      "Evaluation using Accuracy, Precision, Recall, and F1 Score.",
      "Focus on Text Representation impact on classification performance."
    ],
    "link": "https://github.com/Aronno1920/Sentiment-Analysis"
  },
  {
    "id": "58",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/58.png",
    "title": "Fine Tuning Transformers for Question Answer",
    "excerpt":"Question Answering differs from classification tasks by fine-tuning a pre-trained BERT-based model on the SQuAD v1.1 dataset using Hugging Face. The model is then evaluated and tested on real-world questions.",
    "tags": ["Personal","Transformer Fine-Tuning","Question Answering (QA)","Hugging Face","SQuAD","BERT","Exact Match (EM)"],
    "objective": "This assignment focuses on fine-tuning a BERT-based Transformer model for the Question Answering (QA) task using the SQuAD v1.1 dataset. The primary goal is to understand the technical difference between QA and standard classification, and to apply the Hugging Face ecosystem for a deep learning task.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Transformer Fine-Tuning for Question Answering (QA).",
      "Uses BERT-base-uncased on the SQuAD v1.1 dataset.",
      "Implementation via the Hugging Face datasets and transformers APIs.",
      "Evaluation using Exact Match (EM) and F1 Score metrics."
    ],
    "link": "https://colab.research.google.com/drive/1cHJMaC-yK7Ug1CEeaK7cX7dA61agQ4y1#scrollTo=AvCHHO7AmqLB"
  },
  {
    "id": "59",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/59.png",
    "title": "AI Agent for LinkedIn Post Generator",
    "excerpt":"Generate professional, engaging LinkedIn posts in multiple languages with the power of LangChain + GitHub Models.",
    "tags": ["Personal","LangChain Agent","LinkedIn Post Generator","LLM Chain","Content Generation","Multilingual AI","GitHub Models", "Lovable"],
    "objective": "This project involves building a specialized AI Agent using LangChain to automate the creation of professional LinkedIn posts. The agent accepts a user-defined post topic and the desired language.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "LangChain AI Agent for content generation.",
      "Multilingual Post Creation based on user-specified language.",
      "LinkedIn-Optimized Output (professional, engaging structure).",
      "Input variables: Topic and Language."
    ],
    "link": "https://github.com/Aronno1920/PostGenerator-AIAgent-LangChain"
  },
  {
    "id": "60",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/60.png",
    "title": "AI Agent Project with n8n",
    "excerpt":"Mini AI workflow system where the frontend + backend connect to n8n, and n8n handles all article processing.",
    "tags": ["Personal","n8n Workflow Automation","AI Article Summarization","FastAPI & Webhooks","No-Code","Low-Code AI","Gemini Models", "Lovable"],
    "objective": "This project creates a complete AI article processing workflow using n8n as the core automation engine. A Lovable frontend and FastAPI backend capture a user's email and an article URL, initiating the process via an n8n webhook.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Full-Stack Workflow: Frontend, FastAPI Backend, and n8n orchestration.",
      "AI-Powered Article Analysis: Summarization and key insight extraction.",
      "Automated Data Flow: Webhook trigger, data persistence to Google Sheets, and user email delivery.",
      "n8n Automation: Used for all core intelligence and tool integration (Firecrawl, OpenAI, Google Sheets, Email)."
    ],
    "link": "https://github.com/Aronno1920"
  },
  {
    "id": "61",
    "categories": ["ai-solutions", "personal"],
    "image": "./assets/images/project/61.png",
    "title": "Multitools Agent Medical Queries",
    "excerpt":"AI routing for the Medical Agent that automatically routes queries to the most appropriate medical search tools.",
    "tags": ["Personal","Multitools AI Agent","Agent Routing","SQLite","LangChain", "GitHub Models", "Streamlit"],
    "objective": "This project constructs a sophisticated Multi-Tool AI Agent for integrated medical knowledge retrieval. The agent is designed to intelligently route user questions between structured data tools and a general knowledge source.",
    "responsibility":"",
    "technology":"",
    "outcome":"",
    "features": [
      "Intelligent Query Routing to select the best knowledge source.",
      "Three Dedicated Database Tools for querying medical statistics via SQL.",
      "Integration of a Web Search Tool for general, up-to-date medical knowledge.",
      "Uses OpenAI Agent SDK and Langchain Agent Executor for robust logic.",
      "Mixed Queries → Both database and web search tools"
    ],
    "link": "https://github.com/Aronno1920/Multi-Tool-Agent"
  }

]
